In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
index = [1, 2, 3]
names = ['Ali', 'Adel', 'Ahmed']
s2 = pd.Series(names, index=index)
s2

1      Ali
2     Adel
3    Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [4]:
s2.index = [11, 12, 13]
s2

11      Ali
12     Adel
13    Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [12]:
s2.values[0,1]
[[1, a], [2, b]

SyntaxError: unexpected EOF while parsing (538682993.py, line 2)

## Q4: Add duplicate elements, then remove the duplication

In [17]:
s4 = pd.Series({50: 'Saleh', 10: 'Khaled'})
s2 = s2.append(s4)
s2

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_14980\337644408.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s2 = s2.append(s4)

11       Ali
12      Adel
13     Ahmed
50    Khaled
50     Saleh
10    Khaled
dtype: object

In [18]:
s2.drop_duplicates()

11       Ali
12      Adel
13     Ahmed
50    Khaled
50     Saleh
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [24]:
data = {'ID': [123, 456, 789],
        'Name': ['Ahmed', 'Khaled', 'Saleh']}
        
Students = pd.DataFrame(data, columns=['ID', 'Name'])
Students

    ID    Name
0  123   Ahmed
1  456  Khaled
2  789   Saleh

## Q6: Read educ_figdp_1_Data.csv file

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [27]:
edu = pd.read_csv('/Users/Lenovo/LabAdel/Data/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [ ]:
edu.head(3)

In [ ]:
edu.tail()

In [ ]:
edu.columns[0]

In [ ]:
edu.index